[
  {
    "id": 1,
    "projectName": "Turnos FemCare",
    "projectStack": "React, .NET, SQL Server, Azure",
    "projectDescription": "Aplicación web desarrollada para la gestión de turnos en una clínica ginecológica. Permite a las pacientes registrarse, iniciar sesión, reservar, modificar y cancelar turnos con profesionales de la salud. Los administradores pueden gestionar la disponibilidad de los profesionales y visualizar estadísticas de uso. Implementa autenticación segura y notificaciones por correo electrónico.",
    "imageUrl": "/images/projects/FemCare.png",
    "projectLinkFront": "https://github.com/guillesalti/utn_tp_programacion_3",
    "projectLinkBack": "https://github.com/AylenPell/GestionTurnos"
  },
  {
    "id": 2,
    "projectName": "Sr. Cambio",
    "projectStack": "HTML, CSS, JavaScript, Python",
    "projectDescription": "Proyecto final de Programación II (UTN). Consume datos de la DolarAPI para mostrar precios de compra/venta actualizados de distintos tipos de cambio. Incluye validación de actualización (ícono pulgar), envío de precios por mail con EmailJS y un histórico interactivo con gráficos de Chart.js.",
    "imageUrl": "/images/projects/SrCambio.png",
    "projectLink": "https://github.com/guillesalti/tp_final_utn"
  },
  {
    "id": 3,
    "projectName": "Encriptador",
    "projectStack": "HTML, CSS, JavaScript",
    "projectDescription": "Desarrollado para el programa de formación de Alura LATAM. Permite encriptar y desencriptar textos reemplazando vocales según reglas específicas (por ejemplo, 'e' → 'enter'). Proyecto centrado en la lógica de JavaScript, con enfoque en manipulación del DOM y funciones puras.",
    "imageUrl": "/images/projects/EncriptadorAlura.png",
    "projectLink": "https://github.com/lulipalazzini/Challenge-Encriptador"
  },
  {
    "id": 4,
    "projectName": "Ruta Latina",
    "projectStack": "React, React-Bootstrap",
    "projectDescription": "Proyecto real desarrollado durante el curso de React en Coderhouse para la ONG Generando Puentes. La web promociona el foodtruck 'Ruta Latina', que ofrece comida latinoamericana con fines solidarios. El objetivo es generar ingresos para comunidades vulnerables y sostener económicamente a la ONG. Diseño responsive.",
    "imageUrl": "/images/projects/RutaLatina.png",
    "projectLink": "https://github.com/lulipalazzini/generando-puentes"
  },
  {
    "id": 5,
    "projectName": "Astroshop",
    "projectStack": "React",
    "projectDescription": "Proyecto e-commerce desarrollado durante el curso de React en Coderhouse. Nace como continuación de AstroBlog (creado en el curso de Desarrollo Web), con el objetivo de ofrecer productos relacionados con astrología, magia y el mundo esotérico. Diseño responsive.",
    "imageUrl": "/images/projects/Astroshop.png",
    "projectLink": "https://github.com/lulipalazzini/REACT-PF-PALAZZINI"
  }
]
